_posts/2018-09-11-vmware-linux-resolution.html
---
layout     : post
title      : vmware下设置linux分辨率
categories : Linux
tags       : vmware
---
<p>
这个笔记是第一次在VMWare中使用manjaro产生的头大问题。下面的脚本已经不用了。
现在的做法是在进入桌面前，直接开vmware的全屏模式，在进入桌面后，循环使用多个监视器。
</p>

<div class="org-src-container">
<pre class="src src-shell">cvt 1600 900
<span style="color: #586e75;"># </span><span style="color: #586e75;">get modeline then create a sh file</span>
<span style="color: #586e75;">#</span><span style="color: #586e75;">!/bin/zsh</span>
sudo xrandr --newmode <span style="color: #2aa198;">"1600x900_60.00"</span> 118.25  1600 1696 1856 2112  900 903 908 934 -hsync +vsync
sudo xrandr --addmode Virtual1 1600x900_60.00
sudo xrandr --output Virtual1 --mode 1600x900_60.00
</pre>
</div>

<blockquote>
<p>
AUTHOR:  400dama
LINK:    <a href="https://400dama.xyz/2018/09/11/linux-install-note.html">https://400dama.xyz/2018/09/11/linux-install-note.html</a>
LICENSE: 本博客所有文章除特别声明外，均采用 <a href="https://creativecommons.org/licenses/by-nc/4.0/">CC BY-NC 4.0</a> 许可协议。转载请注明出处！
</p>
</blockquote>
